# InvalidArcSegmentation Property (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
BuiltInFailures..::..RoofFailures..::..InvalidArcSegmentation Property
BuiltInFailures..::..RoofFailures Class See Also
---
A segmented slope-defining arc has too few segments.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public static FailureDefinitionId InvalidArcSegmentation { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property InvalidArcSegmentation As FailureDefinitionId
	Get
```

Visual C++
---
```text
public:
static property FailureDefinitionId^ InvalidArcSegmentation {
	FailureDefinitionId^ get ();
}
```

# See Also
BuiltInFailures..::..RoofFailures Class
Autodesk.Revit.DB Namespace